In [1]:
import pandas as pd
import numpy as np
from env import get_db_url

In [2]:
url = get_db_url('employees') #doesn't work correct

In [ ]:
#url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [26]:
pd.read_sql('SELECT * FROM employees LIMIT 5', url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

5. Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

In [23]:
bad_url = get_db_url('wrond_db')

In [28]:
# pd.read_sql('SELECT * FROM employees LIMIT 5', bad_url) #OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user...

b. Intentionally make an error in your SQL query. What does the error message look like?

In [5]:
#pd.read_sql('SELECT * FROM emploees LIMIT 5', url) #ProgrammingError: (pymysql.err.ProgrammingError) (1146, 
#"Table 'employees.emploees' doesn't exist")

6. Read the employees and titles tables into two separate DataFrames.

In [7]:
employees = pd.read_sql('SELECT * FROM employees', url)

In [8]:
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [9]:
titles = pd.read_sql('SELECT * FROM titles', url)

In [10]:
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [11]:
employees.shape

(300024, 6)

In [12]:
titles.shape

(443308, 4)

8. Display the summary statistics for each DataFrame.

In [13]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [14]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

9. How many unique titles are in the ```titles``` DataFrame?

In [17]:
titles.title.nunique()

7

10. What is the oldest date in the ```to_date``` column?

In [18]:
titles.to_date.min()

datetime.date(1985, 3, 1)

11. What is the most recent date in the to_date column?

In [19]:
titles.to_date.max()

datetime.date(9999, 1, 1)

In [77]:
# a query to count the difference between today and to_date
# the query counts the absolute value, so the difference between future and past dates have the same difference

sql = '''
select  to_date, ABS(CURDATE() - to_date) as dif
 from titles
 order by to_date desc;
'''

In [82]:
# move the result of the query to the df
df = pd.read_sql(sql, url)

In [85]:
#past_date[past_date.dif == past_date.dif.min()].to_date.head(1)
recent_date = df[df.dif == df.dif.min()]
recent_date

           to_date     dif
240124  2002-08-01  200126
240125  2002-08-01  200126
240126  2002-08-01  200126
240127  2002-08-01  200126
240128  2002-08-01  200126
240129  2002-08-01  200126
240130  2002-08-01  200126
240131  2002-08-01  200126
240132  2002-08-01  200126
240133  2002-08-01  200126
240134  2002-08-01  200126
240135  2002-08-01  200126
240136  2002-08-01  200126
240137  2002-08-01  200126
240138  2002-08-01  200126
240139  2002-08-01  200126
240140  2002-08-01  200126
240141  2002-08-01  200126
240142  2002-08-01  200126
240143  2002-08-01  200126
240144  2002-08-01  200126
240145  2002-08-01  200126
240146  2002-08-01  200126
240147  2002-08-01  200126
240148  2002-08-01  200126
240149  2002-08-01  200126
240150  2002-08-01  200126
240151  2002-08-01  200126
240152  2002-08-01  200126
240153  2002-08-01  200126
240154  2002-08-01  200126
240155  2002-08-01  200126
240156  2002-08-01  200126
240157  2002-08-01  200126
240158  2002-08-01  200126
240159  2002-08-01  200126
240160  2002-08-01  200126
240161  2002-08-01  200126
240162  2002-08-01  200126
240163  2002-08-01  200126

In [86]:
recent_date.head(1).to_date

240124    2002-08-01
Name: to_date, dtype: object